Revit 2026 API

# ElementCanHaveTypeAssigned(Document, ICollectionElementId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool CanHaveTypeAssigned(
	Document document,
	ICollection<ElementId> elementIds
)
```
```vb
Public Shared Function CanHaveTypeAssigned (
	document As Document,
	elementIds As ICollection(Of ElementId)
) As Boolean
```
```cpp
public:
static bool CanHaveTypeAssigned(
	Document^ document,
	ICollection<ElementId^>^ elementIds
)
```
```fsharp
static member CanHaveTypeAssigned :
        document : Document *
        elementIds : ICollection<ElementId> -> bool
```

#### Parameters

document Document

elementIds ICollectionElementId

#### Return Value

Boolean

#### Reference

Element Class

CanHaveTypeAssigned Overload

Autodesk.Revit.DB Namespace